<a href="https://colab.research.google.com/github/camiyuka/Java-DIO/blob/main/Normalizando_BDTitanicipynb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# TADS 1 - Ci√™ncias de Dados

# üìö Recursos para Conex√£o com o Banco

In [ ]:
# Instala√ß√£o de recursos
!pip install mysql-connector

# Importa√ß√£o de Bibliotecas
import mysql.connector as mysql
import pandas as pd
import warnings

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: mysql-connector in /usr/local/lib/python3.10/dist-packages (2.2.9)

In [ ]:
# Conex√£o com o banco de dados
def conectar():
  return mysql.connect(
    host="162.241.60.234",
    user="aapmse05_ads",
    password="el_modelo",
    database="aapmse05_ads"
)

# üìã Mostrando todas as tabelas no BD

In [ ]:
conn = conectar();
cursor=conn.cursor();

cursor.execute("show tables");
result = cursor.fetchall();
for i in result:
  print(i);

('ADS_BOATS',)
('ADS_BODIES',)
('ADS_CABINS',)
('ADS_CABINS_TICKETS',)
('ADS_PASSENGERS',)
('ADS_PASSENGERS_BOATS',)
('ADS_TICKETS',)
('passageiro',)
('passengers',)

#  üõ†  Criando as tabelas (DDL)

In [ ]:
conn = conectar();
cursor=conn.cursor();

query = """ CREATE TABLE ADS_TICKETS(
	id_ticket int primary key,
	ticket varchar(40) not null unique,
	embarked varchar(1),
	fare float,
	type_class int not null
);"""
cursor.execute(query);

In [ ]:
conn = conectar();
cursor=conn.cursor();

query = """ CREATE TABLE ADS_PASSENGERS(
	id_passenger int primary key,
	id_ticket int,
	foreign key (id_ticket) references ADS_TICKETS(id_ticket),
	first_name varchar(255) not null,
	last_name varchar(255) not null,
	title varchar(4) not null,
	sex varchar(20) not null,
	age float,
	num_parents_children int not null,
	num_siblings_spouses int not null,
  home_destination varchar(200),
	survived boolean not null
);
"""
cursor.execute(query);

In [ ]:
conn = conectar();
cursor=conn.cursor();

query = """ CREATE TABLE ADS_BODIES(
 	id_passenger int,
 	body int unique, --
 	primary key (id_passenger),
 	foreign key (id_passenger) references ADS_PASSENGERS(id_passenger)
);
"""
cursor.execute(query);

In [ ]:
conn = conectar();
cursor=conn.cursor();

query = """ CREATE TABLE ADS_CABINS_TICKETS(
  	id_ticket int,
  	id_cabin int,
  	primary key (id_ticket , id_cabin),
  	foreign key (id_ticket) references ADS_TICKETS(id_ticket),
  	foreign key (id_cabin) references ADS_CABINS(id_cabin)
);
"""
cursor.execute(query);

In [ ]:
conn = conectar();
cursor=conn.cursor();

query = """ CREATE TABLE ADS_CABINS(
	id_cabin int primary key,
	cabin varchar(20)
);
"""
cursor.execute(query);

In [ ]:
conn = conectar();
cursor=conn.cursor();

query = """ CREATE TABLE ADS_BOATS(
  	id_boat int primary key,
  	boat varchar(2)
);
"""
cursor.execute(query);

In [ ]:
conn = conectar();
cursor=conn.cursor();

query = """ CREATE TABLE ADS_PASSENGERS_BOATS(
  	id_passenger int,
  	id_boat int,
  	primary key (id_passenger, id_boat),
  	foreign key (id_passenger) references ADS_PASSENGERS(id_passenger),
  	foreign key (id_boat) references ADS_BOATS(id_boat)
);
"""
cursor.execute(query);

In [ ]:
conn = conectar();
cursor=conn.cursor();

query = """
ALTER TABLE ADS_BOATS MODIFY boat varchar(2) NOT NULL;

"""
cursor.execute(query);

# Verificando quais tabelas est√£o preenchidas (DML)

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT * FROM ADS_PASSENGERS"

df = pd.read_sql(query,conn);

df

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT * FROM ADS_BODIES"
df = pd.read_sql(query,conn);
df

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT * FROM ADS_TICKETS"
df = pd.read_sql(query,conn);
df

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT * FROM ADS_CABINS"
df = pd.read_sql(query,conn);
df

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT * FROM ADS_CABINS_TICKETS"
df = pd.read_sql(query,conn);
df

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT * FROM ADS_PASSENGERS_BOATS"
df = pd.read_sql(query,conn);
df

     id_passenger  id_boat
0             100        1
1             101        1
2             118        1
3             257        1
4             281        1
..            ...      ...
492           924       20
493          1061       20
494          1078       20
495          1123       20
496          1124       20

[497 rows x 2 columns]

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT * FROM ADS_BOATS"
df = pd.read_sql(query,conn);
df

In [ ]:
conn = conectar()
warnings.filterwarnings('ignore');
query = "SELECT * FROM passengers "
df = pd.read_sql(query,conn);
df

In [ ]:
# Extrair informa√ß√µes gerais do dataframe/tabelas em PHYTON
df.info()

# Inserindo dados (DML)

Foi utilizado o m√©todo de inser√ß√£o de dados via tabela do Excel para realizar a popula√ß√£o das entidades. Al√©m disso, conta-se com o aux√≠lio da fun√ß√£o `.format()` de phyton.

In [ ]:
conn = conectar();
dfPassengers = pd.read_excel('./tablePassenger.xlsx') # Fazer upload do arquivo fonte


for i in range(dfPassengers.size -1):
  cursor = conn.cursor()
  query = "INSERT INTO ADS_PASSENGERS (id_passenger,id_ticket,first_name,last_name,title,sex,age, num_parents_children, num_siblings_spouses,home_destination, survived) VALUES ('{id_passenger}', '{id_ticket}', '{first_name}','{last_name}','{title}','{sex}', '{age}', '{num_parents_children}', '{num_siblings_spouses}', '{home_destination}', '{survived}')".format(id_passenger = dfPassengers['id_passengers'][i], id_ticket =dfPassengers['ticket_id'][i], first_name =dfPassengers['first_name'][i], last_name =dfPassengers['last_name'][i], title = dfPassengers['title'][i], sex= dfPassengers['sex'][i], age = dfPassengers['age'][i] , num_parents_children = dfPassengers['num_parents_childrens'][i], num_siblings_spouses = dfPassengers['num_siblings_spouses'][i], home_destination = dfPassengers['home_dest'][i], survived =  dfPassengers['survived'][i])
  cursor.execute(query)
conn.commit()

In [ ]:
conn = conectar();

dfCT = pd.read_excel('./tableCabinsTicket.xlsx')

for i in range(dfCT.size):
  cursor = conn.cursor()
  query = "INSERT INTO ADS_CABINS_TICKETS (id_ticket,	id_cabin) VALUES ('{id_ticket}', '{id_cabin}') ".format(id_ticket = dfCT['id_ticket'][i], id_cabin =dfCT['id_cabin'][i])
  cursor.execute(query)
conn.commit()

In [ ]:
conn = conectar();
dfBodies = pd.read_excel('./tableBodies.xlsx')

for i in range(dfBodies.size):
  cursor = conn.cursor()
  query = "INSERT ADS_BODIES (id_passenger,body) VALUES ('{id_passenger}', '{body}')".format(id_passenger = dfBodies['id_passengers'][i], body = dfBodies['BODIES'][i])
  cursor.execute(query)

In [ ]:
conn = conectar();

dfTicket = pd.read_excel('./tableTicket.xlsx')

for i in range(dfTicket.size):
  cursor=conn.cursor();
  query = "INSERT INTO ADS_TICKETS (id_ticket,ticket,embarked, fare,type_class) values ('{id_ticket}', '{ticket}','{embarked}','{fare}','{type_class}')".format(id_ticket = dfTicket['Id'][i], ticket = dfTicket['Ticket'][i],  embarked = dfTicket['emberked'][i], fare = dfTicket['fare'][i], type_class = dfTicket['pclass'][i])
  cursor.execute(query);
conn.commit()

In [ ]:
conn = conectar();

dfTicket = pd.read_excel('./table_Passengers_boats.xls')

for i in range(dfTicket.size):
  cursor=conn.cursor();
  query = "INSERT INTO ADS_PASSANGERS_BOATS (id_passenger,	id_boat) values ('{id_passenger}', '{id_boat}')".format(id_passenger = dfTicket['id_passenger'][i], id_boat = dfTicket['id_boat'][i])
  cursor.execute(query);
conn.commit()

In [ ]:
conn.commit()

# üîç Buscas (DQL)

- Mostrando todos os mortos

In [ ]:
conn = conectar();

warnings.filterwarnings('ignore');
query = "SELECT first_name, survived FROM  ADS_PASSENGERS WHERE survived = 0"

df = pd.read_sql(query, conn);
df

- Buscando os corpos que foram encontrados

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT first_name, survived, body FROM  ADS_PASSENGERS INNER JOIN ADS_BODIES USING(id_passenger) WHERE survived = 0 "

df = pd.read_sql(query,conn);

df

- Mostrando quais falecidos tiveram o corpo encontrado ou n√£o

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT first_name, survived, body FROM  ADS_PASSENGERS LEFT JOIN ADS_BODIES USING(id_passenger) WHERE survived = 0 "

df = pd.read_sql(query,conn);

df

- Mostrando os tickets de cada passageiro

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT title, first_name, last_name,  ticket FROM  ADS_PASSENGERS INNER JOIN ADS_TICKETS USING(id_ticket) order by last_name "

df = pd.read_sql(query,conn);

df

- Mostrando o ticket de um passageiro espec√≠fico

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT title, first_name, last_name,  ticket FROM  ADS_PASSENGERS INNER JOIN ADS_TICKETS USING(id_ticket) where id_passenger = 4 order by last_name "

df = pd.read_sql(query,conn);

df

- Mostrando a cabine e o ticket de cada passageiro

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT type_class, last_name, first_name, ticket, cabin FROM (ADS_PASSENGERS INNER JOIN ADS_TICKETS USING(id_ticket)) LEFT JOIN (ADS_CABINS_TICKETS INNER JOIN ADS_CABINS USING (id_cabin)) USING(id_ticket) "

df = pd.read_sql(query,conn);

df

- Mostrando apenas os passageiros que possuem botes

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT distinct last_name, title, first_name  FROM ADS_PASSENGERS INNER JOIN ADS_PASSENGERS_BOATS USING (id_passenger) INNER JOIN ADS_BOATS USING (id_boat) "

df = pd.read_sql(query,conn);

df

- Mostrando campos que come√ßam com a palavra E

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT last_name, title, first_name  FROM ADS_PASSENGERS INNER JOIN ADS_PASSENGERS_BOATS USING (id_passenger) INNER JOIN ADS_BOATS USING (id_boat)  WHERE first_name LIKE 'E%' "

df = pd.read_sql(query,conn);
df

- Mostrando os botes dos passageiros

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT last_name, title, first_name, boat  FROM ADS_PASSENGERS INNER JOIN ADS_PASSENGERS_BOATS USING (id_passenger) INNER JOIN ADS_BOATS USING (id_boat) "

df = pd.read_sql(query,conn);
df

# üîç BUSCAS - Gerando uma tabela √∫nica

###C√≥digo Completo

**Mostrandos as colunas na ordem original**

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT id_passenger,type_class, survived, last_name, title,first_name, sex, age, num_siblings_spouses,num_parents_children, ticket, fare, cabin, embarked, body, boat, home_destination FROM ((((ADS_BODIES RIGHT JOIN ADS_PASSENGERS USING (id_passenger)) INNER JOIN ADS_TICKETS USING(id_ticket)) LEFT JOIN ADS_CABINS_TICKETS USING (id_ticket)) LEFT JOIN ADS_CABINS USING(id_cabin)) LEFT JOIN (ADS_PASSENGERS_BOATS INNER JOIN ADS_BOATS USING (id_boat)) USING (id_passenger) "

df = pd.read_sql(query,conn);

df

,id_passenger,type_class,survived,last_name,title,first_name,sex,age,num_siblings_spouses,num_parents_children,ticket,fare,cabin,embarked,body,boat,home_destination
0,1,1,1,Allen,Miss,Elisabeth Walton,female,29.0,0,0,24160,211.3370,B3,S,NaN,2,"St Louis, MO"
1,1,1,1,Allen,Miss,Elisabeth Walton,female,29.0,0,0,24160,211.3370,B5,S,NaN,2,"St Louis, MO"
2,181,1,1,Kreuchen,Miss,Emilie,female,39.0,0,0,24160,211.3370,B3,S,NaN,2,"New York, NY"
3,181,1,1,Kreuchen,Miss,Emilie,female,39.0,0,0,24160,211.3370,B5,S,NaN,2,"New York, NY"
4,194,1,1,Madill,Miss,Georgette Alexandra,female,15.0,0,1,24160,211.3370,B3,S,NaN,2,"Duluth, MN"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1457,1305,3,0,Zabour,Miss,Hileni,female,14.5,1,0,2665,14.4542,None,C,328.0,None,nan
1458,1306,3,0,Zabour,Miss,Thamine,female,0.0,1,0,2665,14.4542,None,C,NaN,None,nan
1459,1307,3,0,Zakarian,Mr,Mapriededer,male,26.5,0,0,2656,7.2250,None,C,304.0,None,nan
1460,1308,3,0,Zakarian,Mr,Ortin,male,27.0,0,0,2670,7.2250,None,C,NaN,None,nan
1461,1309,3,0,Zimmerman,Mr,Leo,male,29.0,0,0,315082,7.8750,None,S,NaN,None,nan

**Op√ß√£o 2**: Juntando de acordo com os relacionamentos do DER

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT * FROM (ADS_BODIES RIGHT JOIN ADS_PASSENGERS USING (id_passenger) LEFT JOIN ADS_TICKETS USING (id_ticket) LEFT JOIN ADS_CABINS_TICKETS USING(id_ticket) LEFT JOIN ADS_CABINS USING(id_cabin)) LEFT JOIN (ADS_PASSENGERS_BOATS INNER JOIN ADS_BOATS USING (id_boat)) USING (id_passenger) "

df = pd.read_sql(query,conn);

df

**Op√ß√£o 3**: Juntando sem separa√ß√£o de par√™nteses

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT * FROM ADS_BODIES RIGHT JOIN ADS_PASSENGERS USING (id_passenger) LEFT JOIN ADS_TICKETS USING (id_ticket) LEFT JOIN ADS_CABINS_TICKETS USING(id_ticket) LEFT JOIN ADS_CABINS USING(id_cabin) LEFT JOIN ADS_PASSENGERS_BOATS USING(id_passenger) LEFT JOIN ADS_BOATS USING (id_boat)  "

df = pd.read_sql(query,conn);

df

### Etapas da uni√£o
Comandos:
- `t1 LEFT JOIN t2 USING(fk)`
- `t1 RIGHT JOIN t2 USING (fk)`

- Juntando tabela ADS_PASSENGERS e ADS_BODIES

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT * FROM ADS_BODIES RIGHT JOIN ADS_PASSENGERS USING (id_passenger)  "

df = pd.read_sql(query,conn);

df

- Unindo tabela ADS_BODIES, ADS_PASSENGERS, ADS_TICKETS

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT * FROM (ADS_BODIES RIGHT JOIN ADS_PASSENGERS USING (id_passenger)) INNER JOIN ADS_TICKETS USING(id_ticket) "

df = pd.read_sql(query,conn);

df

- Juntando com ADS_CABINS_TICKETS e ADS_CABINS

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT * FROM (((ADS_BODIES RIGHT JOIN ADS_PASSENGERS USING (id_passenger)) INNER JOIN ADS_TICKETS USING(id_ticket)) LEFT JOIN ADS_CABINS_TICKETS USING (id_ticket)) LEFT JOIN ADS_CABINS USING(id_cabin) "

df = pd.read_sql(query,conn);

df

- Juntando com ADS_PASSENGERS_BOATS e ADS_BOATS

In [ ]:
conn = conectar();
warnings.filterwarnings('ignore');
query = "SELECT * FROM ((((ADS_BODIES RIGHT JOIN ADS_PASSENGERS USING (id_passenger)) INNER JOIN ADS_TICKETS USING(id_ticket)) LEFT JOIN ADS_CABINS_TICKETS USING (id_ticket)) LEFT JOIN ADS_CABINS USING(id_cabin)) LEFT JOIN (ADS_PASSENGERS_BOATS INNER JOIN ADS_BOATS USING (id_boat)) USING (id_passenger) "

df = pd.read_sql(query,conn);

df